{
  "basics": {
    "name": "Brandon Ferioli",
    "label": "UI/UX Developer",
    "picture": "",
    "email": "b@ferio.li",
    "phone": "(505) 205-8452",
    "website": "http://brandonferioli.com",
    "summary": "I live for the thrill of developing engaging web products and experiences. My core strengths are in UI/UX development, project management, and team leadership. I love any opportunity to have a significant hand and voice in shaping an idea into a fully formed product.",
    "location": {
      "address": "2 Mead Street, Apt 1",
      "city": "Allston",
      "countryCode": "US",
      "region": "Massachusetts, 02134"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "bferioli",
        "url": "https://github.com/bferioli"
      },
      {
        "network": "LinkedIn",
        "url": "www.linkedin.com/pub/brandon-ferioli/27/182/891/en"
      },
      {
        "network": "Twitter",
        "username": "bferioli",
        "url": "http://twitter.com/bferioli"
      }
    ]
  },
  "work": [
    {
      "company": "SecretFancy",
      "position": "Founder, Developer",
      "website": "http://secretfancy.com",
      "startDate": "2015-02-11",
      "summary": "Over the three days leading up to Valentine's Day 2015, I developed an app that allows 'secret admirers' to share their feelings, and provide a mechanism through which they could be matched with the recipient only if the feeling is mutual.",
      "highlights": [
        "Concepted, designed, and developed a production-ready app in three days",
        "Used Backbone, RequireJS, Node, and MongoDB to create a full-stack JS app",
        "Leveraged SendGrid and Twilio to send messages via email and SMS"
      ]
    },
    {
      "company": "General Assembly",
      "position": "Expert In Residence",
      "website": "http://generalassemb.ly",
      "startDate": "2015-01-21",
      "summary": "As an expert in residence for General Assembly's popular FEWD (Front End Web Development) course, I have the opportunity to work hands-on with students to foster engagement and help them acheive mastery.",
      "highlights": [
        "Provided hands-on support and guidance to students",
        "Fostered and maintained ongoing relationships with students",
        "Facilitated the distribution and assessment of course assignments and materials"
      ]
    },
    {
      "company": "HubSpot",
      "position": "Front-end Developer",
      "website": "http://hubspot.com",
      "startDate": "2014-08-04",
      "endDate": "2014-11-20",
      "summary": "As a front-end engineer on the HubSpot Reporting product, I had the opportunity to develop engaging data-driven experiences to help the customer understand and visualize their marketing outcomes.",
      "highlights": [
        "Use CoffeeScript and Backbone.js to develop front-end components for Reports product",
        "Create exceptional user interfaces and experiences using HTML5, CSS3 and Sass",
        "Collaborate with product manager, tech lead, and other team members to identify and tackle goals"
      ]
    },
    {
      "company": "MyFonts",
      "position": "Front-end Developer",
      "website": "http://myfonts.com",
      "startDate": "2013-04-15",
      "endDate": "2014-07-25",
      "summary": "As the sole front-end developer on the MyFonts team, I had the opportunity to take ownership of a variety of front-end projects on a large scale e-commerce site with $20M+ annual revenue.",
      "highlights": [
        "Developed and maintained major site components using JS, PHP and Smarty templates",
        "Developed JavaScript-based tool for previewing live webfonts",
        "Developed a JavaScript bin-packing algorithm to build a staggered image tile layout",
        "Implemented Backbone.js based shopping cart"
      ]
    },
    {
      "company": "Tuatara",
      "position": "UI Developer",
      "website": "http://gilapad.com",
      "startDate": "2012-05-12",
      "endDate": "2013-03-22",
      "summary": "As the UI Developer for Tuatara's flagship GilaPad e-textbook and learning platform, I was able to bridge the gap between design and engineering and create engaging reading and note-taking experiences.",
      "highlights": [
        "Developed e-reader and notepad UI components using JS and Handlebars templates",
        "Developed rich WYSIWYG text editor for notepad component",
        "Developed e-book store UI using Ember.js and Handlebars templates"
      ]
    },
    {
      "company": "SantaFe.com",
      "position": "UI Developer",
      "website": "http://santafe.com",
      "startDate": "2011-10-03",
      "endDate": "2012-05-01",
      "summary": "As one of two front-end developers on the SantaFe.com, I had the opportunity to develop information rich experiences for the Santa Fe, New Mexico based city tourism website.",
      "highlights": [
        "Designed UI wireframes and mockups",
        "Developed ExpressionEngine templates",
        "Created jQuery Mobile based mobile web app"
      ]
    },
    {
      "company": "Ipsum Creative",
      "position": "Founder, Principal Front-end Developer",
      "website": "http://ipsumcreative.com",
      "startDate": "2007-07-01",
      "endDate": "2011-09-30",
      "summary": "As the founder and principal front-end developer for a small web design and development firm, I had the opportunity to manage projects collaborate with team members to develop web products for a variety of local clients.",
      "highlights": [
        "Developed sites and apps using HTML, CSS, JavaScript and jQuery",
        "Developed CMS-based sites using WordPress, ExpressionEngine",
        "Facilitated all communications and presentations with clients",
        "Managed projects; identified and assigned project tasks"
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "JDRF",
      "position": "Team Leader",
      "website": "http://jdrf.org/",
      "startDate": "2008-07-01",
      "endDate": "2009-07-01",
      "summary": "Lead a fundraising group in JDRF's annual Walk for a Cure, acheiving the second highest team fundraising goal.",
      "highlights": [
        "Awarded 'Silver Level of Achievement' two years in a row"
      ]
    }
  ],
  "education": [
    {
      "institution": "Self-taught",
      "area": "Front-end Development",
      "studyType": "Online Learning",
      "startDate": "2006-01-01",
      "courses": [
        "Anatomy of Backbone.js",
        "Assembling Sass",
        "CoffeeScript",
        "Real-time Web with Node.js",
        "Responsive Web Design"
      ]
    }
  ],
  "skills": [
    {
      "name": "Front-end Development",
      "level": "Master",
      "keywords": [
        "HTML5/CSS3",
        "JavaScript",
        "jQuery",
        "Backbone",
        "RequireJS",
        "Node.js",
        "Git & GitHub",
        "Command Line"
      ]
    }
  ],
  "interests": [
    {
      "name": "Fitness",
      "keywords": [
        "Running",
        "Core Strength",
        "Yoga",
        "Cycling"
      ]
    }
  ],
  "references": [
    {
      "name": "Nick Cochrane - Google",
      "reference": "I’ve known and worked with Brandon for a number of years spanning projects that range from simple website design for well known universities in the Boston area to complex web applications for startups. In the time I’ve known Brandon I’ve always been impressed with his ability to grasp new concepts and push into new territory. He has a keen eye for design and a solid understanding of user experience that play well with his ability in development. His ability to work as part of a team while still being able to self direct will be an asset to any team that he joins."
    }
  ]
}